<template>
  <div class="announcement-detail-page">
    <div class="title">
      <h1>免責聲明</h1>
      <h3>日期:2025/02/05</h3>
    </div>

    <div class="content">
      <p>1、本服務器只作為網遊愛好者交流使用，按照研究學習設計思想和原理為目的 ！</p>
      <p>
        2、所有程序皆為日本開發團隊研發，所有遊戲內容模組與台灣某公司代理之韓國"天堂"完全不同，絕沒有侵權或惡意抄襲、篡改其他遊戲內容問題，若有雷同純屬巧合！
      </p>
      <p>
        3、服務器不進行商業行為，所有贊助款項皆為玩家自願性贊助玩家所贊助的經費，全數用於伺服器的平衡開支與人員技術研究費用。一但贊助匯款後就代表同意了我們的聲明不會有任何退費的服務機制。
      </p>
      <p>4、伺服擁有對以上聲明的最終解釋權，如果您發現本伺服出現侵權或者觸及法律條文的內容，可及時向管理員提出,本伺服將會對此進行核實查證！</p>
      <p>
        5、本伺服的遊戲主程式和服務器端程序均來自網路發佈，版本歸原作者所有，而本服經過技術團隊對其內容的修改與創新增添遊戲安全設置，本伺服程式內容是按照研究學習設計思想和交流為目的，絕沒有故意侵權或惡意抄襲、篡改其他遊戲內容！
      </p>
      <p>
        6、本伺服玩家須遵守規定,並承諾不得使用<包括僅嘗試使用>外掛程式,不得嘗試尋找或使用漏洞進行破壞遊戲或破壞遊戲平衡性.對於使用外掛程式或者利用程式漏洞進行破壞遊戲、遊戲中惡意干擾煽動者，本服有權利採取包括封停帳號，封鎖IP等處罰措施並不需要違規者同意！
      </p>
      <p>
        7、對於非可抗拒原因引起服務器關閉，回朔數據錯誤等事件本服不負任何責任，玩家對於此類事件不可以任何理由要求本伺服進行賠償，但是我們承諾會盡心盡力做到服務器的穩定運行以及保障遊戲內容的公平性與合理性！
      </p>
      <p>8、對於玩家的物品、裝備、任何虛擬寶物，被另外玩家騙取或者盜號，本伺服器不負任何責任，玩家對於此類事件不可以任何理由要求回到天堂進行求償！</p>
    </div>
    <h2>暮光之城團隊~</h2>
  </div>
</template>
<script setup></script>

<style scoped>
.announcement-detail-page {
  color: #eee;
  margin: 50px auto;
  width: 1000px;
}
.title {
  display: flex;
  justify-content: space-between;
  align-items: center;
  border-bottom: 2px solid #949494;
}
.content {
  margin-top: 20px;
  line-height: 32px;
}
h2 {
  padding-top: 10px;
  text-align: right;
}
</style>
