<template>
  <div class="content">
    <h2>【王族】</h2>
    <ul>
      <li>1.血盟上限最多可招收100人</li>
      <li>2.王族PVP傷害提升20%</li>
      <li>3.精準目標倍率 對目標玩家加成1.2倍傷害</li>
      <li>4.衝擊士氣-畫面內全盟友 額外攻擊+5</li>
      <li>5.鋼鐵士氣-畫面內全盟友 防禦+8</li>
      <li>6.激勵士氣-畫面內全盟友 命中+5 魔防+20%</li>
      <li>7.王者加護 施放範圍:玩家組隊、同畫面皆可獲得以下能力:力量+1、敏捷+1、智力+1、昏迷耐性+2、支撐耐性+2、魔防+10(王族要當隊長)</li>
      <li>8.鋼鐵士氣與激勵士氣效果無法共存</li>
    </ul>
    <h2>【騎士】</h2>
    <ul>
      <li>1.衝暈秒數：2 ~ 5 秒</li>
      <li>
        2.衝暈成功機率：低於對方等級：30% / 同等級：50% / 高於對方等級：60% (衝暈機率受裝備屬性”昏迷命中”/”昏迷耐性”影響，命中+1%=成功率+1% /
        耐性+1%=成功率-1%)
      </li>
      <li>3.反擊屏障 發動率 20% 傷害倍率 1.8 ，無法對遠距離攻擊觸發</li>
    </ul>

    <h2>【妖精】</h2>
    <ul>
      <li>1.屬性之火發動率：40% 傷害倍率：2倍</li>
    </ul>

    <h2>【法師】</h2>
    <ul>
      <li>1.負面魔法皆受智力與魔法命中影響成功率</li>
      <li>2.基礎成功機率：低於對方等級：20% / 同等級：25% / 高於對方等級：30%</li>
    </ul>

    <h2>【黑暗妖精】</h2>
    <ul>
      <li>1.燃燒鬥志發動率：30%</li>
      <li>2.燃燒鬥志傷害倍率：1.5倍</li>
      <li>3.雙重破壞發動率35%</li>
      <li>4.雙重破壞倍率2.1倍</li>
    </ul>
  </div>
</template>
<script setup></script>

<style scoped>
.content {
  color: rgb(240, 240, 240);
  padding: 20px 0px;
  line-height: 28px;
}
h2 {
  color: rgb(212, 150, 17);
  font-size: 20px;
}
ul {
  margin-bottom: 20px;
}
</style>
