<template>
  <div class="content">
    <p>
      本伺服器 屬於興趣研究性質，伺服器模式是秉持著長期研究經營的心態， 完全屬於免費,
      我們如同任何遊戲官方一樣，無法保證何時會結束伺服器，但我們會努力並盡量的維持下去，
      長久經營絕對有可能，只要有心就做得下去，我們絕不會放棄！這是所能給各位的承諾！
    </p>
    <p>
      我們並非彷間一般開服業者、玩家轉GM花錢買版本、甚至是多開與換名的那種惡質開服團隊
      玩家的贊助，全數用於伺服器的平衡開支與人員研究技術費用，一旦贊助匯款後，就代表你同意了我們的聲明，我們不會有任何退費的服務
      用遊戲元寶購買遊戲內虛擬物品時，請務必先至論壇觀看好使用說明後再購買，一旦購買後我們絕不會退貨，請玩家務必注意！ 特別聲明:
      您願意贊助我們很開心,為求公平如果您要談福利客服有權不回應,
    </p>
    <p>比例按照下列方式,所有一切都公開,請自行是否符合您的需求. 贊助玩家必讀須知：</p>
    <p>1、必需於自行開單便利商店繳款，如非使用自行開單便利商店繳款，任何損失一律自行負責。</p>
    <p>2、凡已使用金幣兌換或購買道具，皆無法退還成金幣。</p>
    <p>3、玩家即使贊助後，如有任何違規同樣會接受公平處分，違規被封鎖帳號所有贊助和物品恕不退回。</p>
    <p>4、玩家必須出於自願贊助以利維持伺服器運行。</p>
    <p>5、請玩家自行保管好自己的帳號、密碼及自身的重要物品與裝備不要互相轉借。</p>
    <p>6、金幣 所購得的物品，如出現強化爆掉或死亡噴掉由玩家自行負責。</p>
    <p>7、金幣所購得的物品，玩家若轉借發生糾紛或因轉借而遺失，本服不介入處理。</p>
    <p>8、在正義值不滿的情況下死亡，贊助物品有機率會噴落。</p>
    <p>9、所有贊助在任何情況下，包括伺服器停止運作，恕不退回。</p>
  </div>
</template>
<script setup></script>

<style scoped>
.sponsor-declar-page {
  color: aliceblue;
  margin: 50px auto;
  width: 1000px;
}
.title {
  display: flex;
  justify-content: space-between;
  align-items: center;
  border-bottom: 2px solid #949494;
}
.content {
  margin-top: 20px;
  line-height: 34px;
}
</style>
