<template>
  <div class="content">
    <h2>王族</h2>
    <ul>
      <li>1.血盟上限最多可招收100人</li>
      <li>2.王族PVP傷害提升20%</li>
      <li>3.精準目標倍率 對目標玩家加成1.2倍傷害</li>
      <li>4.灼熱武器-攻擊命中+5 額外攻擊+5</li>
      <li>5.猛意志-機率造成1.5倍傷害</li>
      <li>6.王者加護 施放範圍:玩家組隊、同畫面皆可獲得以下能力:力量+1、敏捷+1、智力+1、昏迷耐性+2、支撐耐性+2、魔防+10(王族要當隊長)</li>
      <li>7.閃耀之盾無法與灼熱武器共存</li>
    </ul>

    <h2>騎士</h2>
    <ul>
      <li>1.衝暈秒數：2 ~ 5 秒</li>
      <li>
        2.衝暈成功機率：低於對方等級：40% / 同等級：45% / 高於對方等級：50% (衝暈機率受裝備屬性”昏迷命中”/”昏迷耐性”影響，命中+1%=成功率+1% /
        耐性+1%=成功率-1%)
      </li>
      <li>3.3.反擊屏障 發動率 20% 傷害倍率 1.8 ，可對遠距離觸發，對遠距離傷害為1.5倍</li>
    </ul>

    <h2>妖精</h2>
    <ul>
      <li>1.三重矢傷害：1.2倍</li>
      <li>2.屬性之火發動率：40% 傷害倍率：2倍</li>
    </ul>

    <h2>法師</h2>
    <ul>
      <li>1.負面魔法皆受智力影響成功率</li>
      <li>2.基礎成功機率：低於對方等級：20% / 同等級：25% / 高於對方等級：30%</li>
      <li>3.寒冰尖刺無學習等級限制 學習後會變成道具化 會出現在道具欄內 ※請注意寒冰尖刺學習後 無法交易,無法刪除.無法存倉 限定法師職業能使用</li>
    </ul>

    <h2>黑暗妖精</h2>
    <ul>
      <li>1.燃燒鬥志發動率：30%</li>
      <li>2.燃燒鬥志傷害倍率：1.5倍</li>
      <li>3.雙重破壞發動率35%</li>
      <li>4.雙重破壞倍率2.1倍</li>
    </ul>
  </div>
</template>
<script setup></script>

<style scoped>
.content {
  color: rgb(240, 240, 240);
  padding: 20px 0px;
  line-height: 28px;
}
h2 {
  color: brown;
}
ul {
  margin-bottom: 20px;
}
</style>
